nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmrw612/ncp_examples/ncp_device/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 25.03.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F6, peripheral: FLEXCOMM3, signal: USART_TXD, pin_signal: GPIO_26}
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: G13, peripheral: GPIO, signal: 'PIO1, 10', pin_signal: GPIO_42}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC3_USART_DATA functionality on pin GPIO_26, GPIO_24 (pin F6_E5) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize GPIO42 functionality on pin GPIO_42 (pin G13) */
    IO_MUX_SetPinMux(IO_MUX_GPIO42);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_NCP:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: K12, peripheral: GPIO, signal: 'PIO1, 18', pin_signal: GPIO_50}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_NCP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins_NCP(void)
{
    /* Initialize GPIO50 functionality on pin GPIO_50 (pin K12) */
    IO_MUX_SetPinMux(IO_MUX_GPIO50);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_NCP_SPI:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: C13, peripheral: FLEXCOMM0, signal: SPI_MISO, pin_signal: GPIO_3, pull_up_down: disable}
  - {pin_num: M1, peripheral: FLEXCOMM0, signal: SPI_SSELN0, pin_signal: GPIO_0, pull_up_down: disable}
  - {pin_num: F8, peripheral: FLEXCOMM0, signal: SPI_SCK, pin_signal: GPIO_4, pull_up_down: disable}
  - {pin_num: F10, peripheral: FLEXCOMM0, signal: SPI_MOSI, pin_signal: GPIO_2, pull_up_down: disable}
  - {pin_num: C5, peripheral: GPIO, signal: 'PIO0, 27', pin_signal: GPIO_27, pull_up_down: disable}
  - {pin_num: M2, peripheral: GPIO, signal: 'PIO0, 11', pin_signal: GPIO_11, pull_up_down: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_NCP_SPI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins_NCP_SPI(void)
{
    /* Initialize FC0_SPI_SS0 functionality on pin GPIO_3, GPIO_0, GPIO_4, GPIO_2, GPIO_5 (pin C13_M1_F8_F10_L7) */
    IO_MUX_SetPinMux(IO_MUX_FC0_SPI_SS0);
    /* Initialize GPIO11 functionality on pin GPIO_11 (pin M2) */
    IO_MUX_SetPinMux(IO_MUX_GPIO11);
    /* Initialize GPIO27 functionality on pin GPIO_27 (pin C5) */
    IO_MUX_SetPinMux(IO_MUX_GPIO27);
    /* Set GPIO_0 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(0U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_2 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(2U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_3 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(3U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_4 (pin C13_M1_F8_F10) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(4U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_11 (pin M2) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(11U, IO_MUX_PinConfigNoPull);
    /* Set GPIO_27 (pin C5) configuration - Disable pull-up / pull-down; strongest slew rate */
    IO_MUX_SetPinConfig(27U, IO_MUX_PinConfigNoPull);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_NCP_UART:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: C13, peripheral: FLEXCOMM0, signal: USART_TXD, pin_signal: GPIO_3}
  - {pin_num: F10, peripheral: FLEXCOMM0, signal: USART_RXD, pin_signal: GPIO_2}
  - {pin_num: M1, peripheral: FLEXCOMM0, signal: USART_CTS, pin_signal: GPIO_0}
  - {pin_num: L7, peripheral: FLEXCOMM0, signal: USART_RTS, pin_signal: GPIO_5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_NCP_UART
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins_NCP_UART(void)
{
    /* Initialize FC0_USART_DATA functionality on pin GPIO_3, GPIO_0, GPIO_4, GPIO_2 (pin C13_M1_F8_F10) */
    IO_MUX_SetPinMux(IO_MUX_FC0_USART_DATA);
    /* Initialize FC0_USART_CMD functionality on pin GPIO_3, GPIO_0, GPIO_4, GPIO_2, GPIO_5 (pin C13_M1_F8_F10_L7) */
    IO_MUX_SetPinMux(IO_MUX_FC0_USART_CMD);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
